In [1]:
import pandas as pd
import datetime as dt

In [7]:
df = pd.read_csv('//content//log_update.csv', encoding='ISO8859', error_bad_lines=False, header=None, sep=';', usecols=[0,1,2,4])
df.columns = ('date','time', 'id', 'event_type')
df

             date          time   id event_type
0      17.12.2018  17:59:58:720  924       Misc
1      17.12.2018  17:59:58:782  924       Misc
2      17.12.2018  17:59:58:829  924       Misc
3      17.12.2018  17:59:58:642  924    Service
4      17.12.2018  17:59:58:954  924    Service
...           ...           ...  ...        ...
10304  25.04.2021  00:27:09:831  532         AU
10305  25.04.2021  00:27:14:816  532     Report
10306  25.04.2021  01:50:04:034  532         AU
10307  25.04.2021  01:50:06:912  532         AU
10308  25.04.2021  01:50:09:083  532     Report

[10309 rows x 4 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10309 entries, 0 to 10308
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        10309 non-null  object
 1   time        10309 non-null  object
 2   id          10309 non-null  int64
 3   event_type  10309 non-null  object
dtypes: int64(1), object(3)
memory usage: 322.3+ KB

In [9]:
df['date'] = pd.to_datetime(df['date'], format='%d.%m.%Y')
df['time'] = pd.to_datetime(df['time'], format='%H:%M:%S:%f')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10309 entries, 0 to 10308
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        10309 non-null  datetime64[ns]
 1   time        10309 non-null  datetime64[ns]
 2   id          10309 non-null  int64
 3   event_type  10309 non-null  object
dtypes: datetime64[ns](2), int64(1), object(1)
memory usage: 322.3+ KB

In [13]:
df_au = df[df['event_type'] == 'AU']

In [14]:
df_au['day'] = df_au['date'].dt.day
df_au

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

            date                    time   id event_type  day
22    2018-12-17 1900-01-01 18:00:46.612  924         AU   17
23    2018-12-17 1900-01-01 18:00:46.612  924         AU   17
24    2018-12-17 1900-01-01 18:00:46.612  924         AU   17
25    2018-12-17 1900-01-01 18:00:46.612  924         AU   17
26    2018-12-17 1900-01-01 18:00:46.612  924         AU   17
...          ...                     ...  ...        ...  ...
10301 2021-04-24 1900-01-01 18:34:35.198  532         AU   24
10303 2021-04-24 1900-01-01 23:19:07.258  532         AU   24
10304 2021-04-25 1900-01-01 00:27:09.831  532         AU   25
10306 2021-04-25 1900-01-01 01:50:04.034  532         AU   25
10307 2021-04-25 1900-01-01 01:50:06.912  532         AU   25

[1738 rows x 5 columns]

In [17]:
df_au.groupby('day')['id'].count().sort_values(ascending=False)

day
17    220
13    120
5      97
12     81
21     72
14     71
24     68
26     66
23     55
19     55
2      53
10     53
11     53
9      51
16     49
1      49
18     48
15     44
7      44
22     43
8      42
3      41
6      40
28     40
25     36
31     28
4      27
20     26
29     26
27     22
30     18
Name: id, dtype: int64

In [18]:
df_au[df_au['day'] == 17]

           date                    time   id event_type  day
22   2018-12-17 1900-01-01 18:00:46.612  924         AU   17
23   2018-12-17 1900-01-01 18:00:46.612  924         AU   17
24   2018-12-17 1900-01-01 18:00:46.612  924         AU   17
25   2018-12-17 1900-01-01 18:00:46.612  924         AU   17
26   2018-12-17 1900-01-01 18:00:46.612  924         AU   17
...         ...                     ...  ...        ...  ...
9877 2021-04-17 1900-01-01 14:11:41.013  560         AU   17
9878 2021-04-17 1900-01-01 14:11:41.013  560         AU   17
9879 2021-04-17 1900-01-01 14:11:41.013  560         AU   17
9881 2021-04-17 1900-01-01 15:57:17.038  560         AU   17
9883 2021-04-17 1900-01-01 23:19:07.176  560         AU   17

[220 rows x 5 columns]

In [19]:
col_names = ['date','time', 'id', 'event_type']
func = lambda x: dt.datetime.strptime(x, '%d.%m.%Y %H:%M:%S:%f')

In [20]:
df1 = pd.read_csv('//content//log_update.csv', encoding='ISO8859', error_bad_lines=False, header=None, sep=';', usecols=[0,1,2,4], names=col_names, 
                  parse_dates=[['date', 'time']], date_parser=func)
df1

                    date_time   id event_type
0     2018-12-17 17:59:58.720  924       Misc
1     2018-12-17 17:59:58.782  924       Misc
2     2018-12-17 17:59:58.829  924       Misc
3     2018-12-17 17:59:58.642  924    Service
4     2018-12-17 17:59:58.954  924    Service
...                       ...  ...        ...
10304 2021-04-25 00:27:09.831  532         AU
10305 2021-04-25 00:27:14.816  532     Report
10306 2021-04-25 01:50:04.034  532         AU
10307 2021-04-25 01:50:06.912  532         AU
10308 2021-04-25 01:50:09.083  532     Report

[10309 rows x 3 columns]

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10309 entries, 0 to 10308
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date_time   10309 non-null  datetime64[ns]
 1   id          10309 non-null  int64
 2   event_type  10309 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 241.7+ KB

In [25]:
df1.resample('5Min', on='date_time').id.count().sort_values(ascending=False)

date_time
2020-02-09 09:55:00    186
2020-02-25 11:55:00    158
2020-02-13 11:50:00    130
2021-02-13 19:30:00    124
2018-12-17 18:00:00    115
                      ...
2020-07-11 04:10:00      0
2020-07-11 04:05:00      0
2020-07-11 04:00:00      0
2020-07-11 03:55:00      0
2020-02-20 09:50:00      0
Name: id, Length: 247488, dtype: int64

In [26]:
df1.resample('5Min', on='date_time', offset='1Min').id.count().sort_values(ascending=False)

date_time
2020-02-25 11:56:00    174
2020-02-09 09:56:00    172
2020-02-13 11:51:00    130
2021-02-07 07:16:00    110
2021-02-09 17:11:00    106
                      ...
2020-07-11 04:01:00      0
2020-07-11 03:56:00      0
2020-07-11 03:51:00      0
2020-07-11 03:46:00      0
2020-02-20 09:51:00      0
Name: id, Length: 247487, dtype: int64

In [27]:
df1.resample('5Min', on='date_time', offset='2Min').id.count().sort_values(ascending=False)

date_time
2020-02-09 09:52:00    147
2021-03-15 10:57:00    141
2020-02-25 11:52:00    132
2020-02-13 11:52:00    130
2021-02-07 07:17:00    110
                      ...
2020-07-11 04:07:00      0
2020-07-11 04:02:00      0
2020-07-11 03:57:00      0
2020-07-11 03:52:00      0
2020-02-20 09:52:00      0
Name: id, Length: 247487, dtype: int64

In [28]:
df1.resample('5Min', on='date_time', offset='3Min').id.count().sort_values(ascending=False)

date_time
2020-02-09 09:53:00    186
2021-03-15 10:58:00    141
2020-02-25 11:53:00    140
2020-02-13 11:53:00    130
2021-02-07 07:18:00    110
                      ...
2020-07-11 04:18:00      0
2020-07-11 04:13:00      0
2020-07-11 04:08:00      0
2020-07-11 04:03:00      0
2020-02-20 09:53:00      0
Name: id, Length: 247487, dtype: int64

In [29]:
df1.resample('5Min', on='date_time', offset='4Min').id.count().sort_values(ascending=False)

date_time
2020-02-09 09:54:00    186
2020-02-25 11:54:00    158
2021-03-15 10:59:00    131
2021-02-13 19:29:00    124
2021-01-26 22:34:00    109
                      ...
2020-07-11 04:04:00      0
2020-07-11 03:59:00      0
2020-07-11 03:54:00      0
2020-07-11 03:49:00      0
2020-02-20 09:54:00      0
Name: id, Length: 247487, dtype: int64

In [30]:
res = df1[df1['date_time'].dt.month == 2].groupby([pd.Grouper(key='date_time', freq='30Min'), 'event_type']).count()
res

                                id
date_time           event_type
2019-02-28 14:30:00 AU           9
                    Agent       10
                    DnldMgr      1
                    Misc         3
                    Report      11
...                             ..
2021-02-28 22:00:00 AU           2
                    Report       1
2021-02-28 23:00:00 AU           1
2021-02-28 23:30:00 AU           1
                    Report       1

[543 rows x 1 columns]